test-data/xml/scenario-06-bis-known-gender.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- Scenario 6: BIS Number — Known Gender (Month + 40)
     Born March 1990, gender known: MM=03+40=43 → 904315123
     Mod-97: 904315123 mod 97 = 6, CC = 97-6 = 91
     Valid BIS: 90431512391 -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v1="http://socialsecurity.be/presenceregistration/v1"
                  xmlns:v11="http://socialsecurity.be/presenceregistration/schemas/v1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:RegisterPresencesRequest>
         <v1:PresenceRegistrationRequest>
            <v11:RegistrationDate>2026-03-16</v11:RegistrationDate>
            <v11:INSS>90431512391</v11:INSS>
            <v11:CompanyID>0412345678</v11:CompanyID>
            <v11:WorkPlaceId>W111222333</v11:WorkPlaceId>
         </v1:PresenceRegistrationRequest>
      </v1:RegisterPresencesRequest>
   </soapenv:Body>
</soapenv:Envelope>
